In [10]:
import pandas as pd
import numpy as np
import seaborn as sns
from pydataset import data
import env

DB_URL = f'mysql+pymysql://{env.user_name}:{env.password}@{env.host}/tidy_data'

## 1. Attendance Data

    Read the data from the attendance table and calculate an attendance percentage for each student. One half day is worth 50% of a full day, and 10 tardies is equal to one absence.

    You should end up with something like this:
- name
- Billy    0.5250
- Jane     0.6875
- John     0.9125
- Sally    0.7625
- Name: grade, dtype: float64

In [28]:
sql_attendance_query = 'select * from attendance'
attendance_df = pd.read_sql(sql_attendance_query, DB_URL)

In [16]:
attendance_df

,Unnamed: 0,2018-01-01,2018-01-02,2018-01-03,2018-01-04,2018-01-05,2018-01-06,2018-01-07,2018-01-08
0,Sally,P,T,T,H,P,A,T,T
1,Jane,A,P,T,T,T,T,A,T
2,Billy,A,T,A,A,H,T,P,T
3,John,P,T,H,P,P,T,P,P

In [17]:
attendance_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 9 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Unnamed: 0  4 non-null      object
 1   2018-01-01  4 non-null      object
 2   2018-01-02  4 non-null      object
 3   2018-01-03  4 non-null      object
 4   2018-01-04  4 non-null      object
 5   2018-01-05  4 non-null      object
 6   2018-01-06  4 non-null      object
 7   2018-01-07  4 non-null      object
 8   2018-01-08  4 non-null      object
dtypes: object(9)
memory usage: 416.0+ bytes

In [18]:
attendance_df.columns

Index(['Unnamed: 0', '2018-01-01', '2018-01-02', '2018-01-03', '2018-01-04',
       '2018-01-05', '2018-01-06', '2018-01-07', '2018-01-08'],
      dtype='object')

In [21]:
#Melt 
name_df = attendance_df.melt(id_vars=['Unnamed: 0'], var_name='Day', value_name='Score')
name_df

   Unnamed: 0         Day Score
0       Sally  2018-01-01     P
1        Jane  2018-01-01     A
2       Billy  2018-01-01     A
3        John  2018-01-01     P
4       Sally  2018-01-02     T
5        Jane  2018-01-02     P
6       Billy  2018-01-02     T
7        John  2018-01-02     T
8       Sally  2018-01-03     T
9        Jane  2018-01-03     T
10      Billy  2018-01-03     A
11       John  2018-01-03     H
12      Sally  2018-01-04     H
13       Jane  2018-01-04     T
14      Billy  2018-01-04     A
15       John  2018-01-04     P
16      Sally  2018-01-05     P
17       Jane  2018-01-05     T
18      Billy  2018-01-05     H
19       John  2018-01-05     P
20      Sally  2018-01-06     A
21       Jane  2018-01-06     T
22      Billy  2018-01-06     T
23       John  2018-01-06     T
24      Sally  2018-01-07     T
25       Jane  2018-01-07     A
26      Billy  2018-01-07     P
27       John  2018-01-07     P
28      Sally  2018-01-08     T
29       Jane  2018-01-08     T
30      Billy  2018-01-08     T
31       John  2018-01-08     P

In [23]:
#Rename the column from the new dataframe
name_df.columns = ['name', 'date', 'attendance']
name_df

     name        date attendance
0   Sally  2018-01-01          P
1    Jane  2018-01-01          A
2   Billy  2018-01-01          A
3    John  2018-01-01          P
4   Sally  2018-01-02          T
5    Jane  2018-01-02          P
6   Billy  2018-01-02          T
7    John  2018-01-02          T
8   Sally  2018-01-03          T
9    Jane  2018-01-03          T
10  Billy  2018-01-03          A
11   John  2018-01-03          H
12  Sally  2018-01-04          H
13   Jane  2018-01-04          T
14  Billy  2018-01-04          A
15   John  2018-01-04          P
16  Sally  2018-01-05          P
17   Jane  2018-01-05          T
18  Billy  2018-01-05          H
19   John  2018-01-05          P
20  Sally  2018-01-06          A
21   Jane  2018-01-06          T
22  Billy  2018-01-06          T
23   John  2018-01-06          T
24  Sally  2018-01-07          T
25   Jane  2018-01-07          A
26  Billy  2018-01-07          P
27   John  2018-01-07          P
28  Sally  2018-01-08          T
29   Jane  2018-01-08          T
30  Billy  2018-01-08          T
31   John  2018-01-08          P

In [24]:
#Add new column for attandance score 
score_att = {
    'P': 1,
    'H': 0.5,
    'T': 0.9,
    'A': 0,
}

In [26]:
name_df['attendance_score'] = name_df.attendance.map(score_att)
name_df

     name        date attendance  attendance_score
0   Sally  2018-01-01          P               1.0
1    Jane  2018-01-01          A               0.0
2   Billy  2018-01-01          A               0.0
3    John  2018-01-01          P               1.0
4   Sally  2018-01-02          T               0.9
5    Jane  2018-01-02          P               1.0
6   Billy  2018-01-02          T               0.9
7    John  2018-01-02          T               0.9
8   Sally  2018-01-03          T               0.9
9    Jane  2018-01-03          T               0.9
10  Billy  2018-01-03          A               0.0
11   John  2018-01-03          H               0.5
12  Sally  2018-01-04          H               0.5
13   Jane  2018-01-04          T               0.9
14  Billy  2018-01-04          A               0.0
15   John  2018-01-04          P               1.0
16  Sally  2018-01-05          P               1.0
17   Jane  2018-01-05          T               0.9
18  Billy  2018-01-05          H               0.5
19   John  2018-01-05          P               1.0
20  Sally  2018-01-06          A               0.0
21   Jane  2018-01-06          T               0.9
22  Billy  2018-01-06          T               0.9
23   John  2018-01-06          T               0.9
24  Sally  2018-01-07          T               0.9
25   Jane  2018-01-07          A               0.0
26  Billy  2018-01-07          P               1.0
27   John  2018-01-07          P               1.0
28  Sally  2018-01-08          T               0.9
29   Jane  2018-01-08          T               0.9
30  Billy  2018-01-08          T               0.9
31   John  2018-01-08          P               1.0

In [27]:
avg_attendance = name_df.groupby('name').attendance_score.mean()
avg_attendance

name
Billy    0.5250
Jane     0.6875
John     0.9125
Sally    0.7625
Name: attendance_score, dtype: float64

## Coffee Levels
    
    Read the coffee_levels table.
    
    Transform the data so that each carafe is in it's own column.
    
    Is this the best shape for the data?

In [33]:
sql_coffee_query = 'select * from coffee_levels'
coffee_df = pd.read_sql(sql_coffee_query, DB_URL)
coffee_df

    hour coffee_carafe  coffee_amount
0      8             x       0.816164
1      9             x       0.451018
2     10             x       0.843279
3     11             x       0.335533
4     12             x       0.898291
5     13             x       0.310711
6     14             x       0.507288
7     15             x       0.215043
8     16             x       0.183891
9     17             x       0.391560
10     8             y       0.189297
11     9             y       0.521502
12    10             y       0.023163
13    11             y       0.235529
14    12             y       0.017009
15    13             y       0.997464
16    14             y       0.058361
17    15             y       0.144644
18    16             y       0.544676
19    17             y       0.594126
20     8             z       0.999264
21     9             z       0.915990
22    10             z       0.144928
23    11             z       0.311495
24    12             z       0.771947
25    13             z       0.398520
26    14             z       0.864464
27    15             z       0.436364
28    16             z       0.280621
29    17             z       0.436677

In [35]:
coffee_df.columns

Index(['hour', 'coffee_carafe', 'coffee_amount'], dtype='object')

In [36]:
coffee_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 30 entries, 0 to 29
Data columns (total 3 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   hour           30 non-null     int64
 1   coffee_carafe  30 non-null     object
 2   coffee_amount  30 non-null     float64
dtypes: float64(1), int64(1), object(1)
memory usage: 848.0+ bytes

In [38]:
#Melt is not going to uch useful with this table so we will use pivot table
#It is more readable because we can compare x, y and z
coff_piv = coffee_df.pivot_table(index=['hour'], columns='coffee_carafe', values='coffee_amount')
coff_piv

coffee_carafe         x         y         z
hour
8              0.816164  0.189297  0.999264
9              0.451018  0.521502  0.915990
10             0.843279  0.023163  0.144928
11             0.335533  0.235529  0.311495
12             0.898291  0.017009  0.771947
13             0.310711  0.997464  0.398520
14             0.507288  0.058361  0.864464
15             0.215043  0.144644  0.436364
16             0.183891  0.544676  0.280621
17             0.391560  0.594126  0.436677

## Cake Recipes

    Read the cake_recipes table. This data set contains cake tastiness scores for combinations of different recipes, oven rack positions, and oven temperatures.
    
    Tidy the data as necessary.
    
    Which recipe, on average, is the best? recipe b
    
    Which oven temperature, on average, produces the best results? 275
    
    Which combination of recipe, rack position, and temperature gives the best result?    recipe b, bottom rack, 300 degrees